gram/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def welcome
    @user = User.find(session[:user_id])