gram/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "username", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "starr@one.com"], ["username", "starr"], ["created_at", "2020-08-02 09:52:02.040188"], ["updated_at", "2020-08-02 09:52:02.040188"]]
---
  def create
    @user = User.new(params.require(:user).permit(:email, :username, :password))

    if @user.valid?
      @user.save